Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For example, see https://datatracker.ietf.org/doc/html/rfc8705#section-3.1[JWT Certificate Thumbprint Confirmation Method] and https://datatracker.ietf.org/doc/html/rfc8705#section-3.2[Confirmation Method for Token Introspection] sections of https://datatracker.ietf.org/doc/html/rfc8705[RFC8705].
ja_jp: たとえば、 https://datatracker.ietf.org/doc/html/rfc8705[RFC8705] の https://datatracker.ietf.org/doc/html/rfc8705#section-3.1[JWT 証明書のサムプリントの確認方法] および https://datatracker.ietf.org/doc/html/rfc8705#section-3.2[トークンイントロスペクションの確認方法] セクションを参照してください。

source: For example, set `Category` to `SocialMotivation`, and set `ApplicationCallbackDomain` to either `localhost` or the domain name provided by Ngrok, see the <<redirect_url>> for more information.
ja_jp: たとえば、 `Category` を `SocialMotivation` に設定し、 `ApplicationCallbackDomain` を `localhost`または Ngrok によって提供されるドメイン名に設定します。詳細は <<redirect_url>> を参照してください。

source: For example, setting `quarkus.oidc.authentication.session-expired-page=/session-expired-page` will ensure that the user whose session has expired is redirected to `http://localhost:8080/session-expired-page`, assuming the application is available at `http://localhost:8080`.
ja_jp: たとえば、アプリケーションが `http://localhost:8080` で利用できると仮定した場合、 `quarkus.oidc.authentication.session-expired-page=/session-expired-page` を設定すると、セッションの有効期限が切れたユーザーが `http://localhost:8080/session-expired-page` にリダイレクトされるようになります。

source: For example, suppose we have a logging interceptor with the `@Logged` binding annotation and a tracing interceptor with the `@Traced` binding annotation:
ja_jp: たとえば、 `@Logged` バインディングアノテーションを持つロギングインターセプターと `@Traced` バインディングアノテーションを持つトレースインターセプターがあるとします。

source: For example, suppose we have an interceptor that can automatically log method invocations to certain targets. The interceptor binding annotation `@Logged` would have a member called `target`, which specifies where to store the log. Our implementation could be restricted to console logging and file logging:
ja_jp: たとえば、メソッド呼び出しを特定のターゲットに自動的に記録できるインターセプタ―があるとします。インターセプタ―バインディングアノテーション `@Logged` には、ログを保存する場所を指定する `target` というメンバーがあります。この実装は、コンソールログとファイルロギングに制限することができます。

source: For example, suppose you have resource methods to retrieve users and orders in the application.
ja_jp: 例えば、アプリケーションにユーザーと注文を取得するためのリソースメソッドがあるとします。

source: For example, the `Jackson` extension uses code like below to search for annotations used in JSON deserialization, and add them to the reflective hierarchy for `BUILD_TIME` analysis.
ja_jp: たとえば、 `Jackson` エクステンションは、以下のようなコードを使用して、JSON デシリアライズで使用されるアノテーションを検索し、それらを `BUILD_TIME` 分析のリフレクション階層に追加します。

source: For example, the `io.quarkus.vertx.http.runtime.FormAuthConfig` configuration group will be generated in a file named `quarkus-vertx-http-config-group-form-auth-config.adoc`.
ja_jp: 例えば、 `io.quarkus.vertx.http.runtime.FormAuthConfig` 設定グループは `quarkus-vertx-http-config-group-form-auth-config.adoc` という名前のファイルに生成されます。

source: For example, the `redirect_uri` parameter in the authorization code flow might be set to the internal host instead of the expected external one.
ja_jp: たとえば、認可コードフローの `redirect_uri` パラメーターが、予期される外部ホストではなく内部ホストに設定されている場合があります。

source: For example, the configuration
ja_jp: たとえば、以下の設定は、

source: For example, the credentials may be coming with the HTTP `Authorization` header, client HTTPS certificates or cookies.
ja_jp: 例えば、資格情報は、HTTP `Authorization` ヘッダー、クライアントの HTTPS 証明書、またはクッキーを使用している場合があります。

source: For example, the first example from above becomes:
ja_jp: 例えば、上から1番目の例では、次のようになります:

source: For example, the following JWT token has a complex `groups` claim that contains a `roles` array that includes roles:
ja_jp: たとえば、次の JWT トークンには、ロールが含まれている `roles` 配列を含む複雑な `groups` クレームがあります。

source: For example, the following Page definition will call the `devui-dev-services:devServicesConfig` JsonRPC method at runtime to get the URL to the dev service named `my-dev-service`:
ja_jp: たとえば、以下のページ定義は、`devui-dev-services:devServicesConfig` JsonRPC メソッドをランタイム時に呼び出し、`my-dev-service` という名前の dev service への URL を取得します:

source: For example, the following code snippet registers a filter adding an HTTP header:
ja_jp: たとえば、次のコードスニペットは、HTTP ヘッダーを追加するフィルターを登録します。

source: For example, the following configuration sets the OIDC `tenant-1` configuration requirements:
ja_jp: たとえば、以下の設定は OIDC `tenant-1` の設定要件を定義します。

source: For example, the following configuration will allow for configuring the users in both the production where OAuth2 is required and development modes using xref:config-reference.adoc#profiles[Configuration Profiles].
ja_jp: 例えば、以下の設定では、 xref:config-reference.adoc#profiles[設定プロファイル] を使って、OAuth2が必要な本番モードと開発モードの両方でユーザーを設定することができます。

source: For example, the following configuration will allow for configuring the users in both the production where OAuth2 is required and development modes using xref:config.adoc#configuration-profiles[Configuration Profiles].
ja_jp: 例えば、以下の設定では、 link:config.html#configuration-profiles[Configuration Profiles]を使って、OAuth2が必要な本番モードと開発モードの両方でユーザーを設定することができます。

source: For example, the following entries ensure that the `org.acme:acme-api` dependency is indexed:
ja_jp: たとえば、次のエントリーは、 `org.acme:acme-api` 依存関係が確実にインデックス化されるようにします。

source: For example, the following simple custom `OidcRedirectFilter` adds an additional query parameter and a custom response header for all redirect requests that Quarkus OIDC can do:
ja_jp: たとえば、次の単純なカスタム `OidcRedirectFilter` は、Quarkus OIDC で実行できるすべてのリダイレクトリクエストに対して追加のクエリーパラメーターとカスタムレスポンスヘッダーを追加します。

source: For example, the following simple custom `OidcRedirectFilter` adds an additional query parameter and a custom response header for all redirect requests that can be done by Quarkus OIDC:
ja_jp: たとえば、次の単純なカスタム `OidcRedirectFilter` は、Quarkus OIDC で実行できるすべてのリダイレクトリクエストに対して追加のクエリーパラメーターとカスタムレスポンスヘッダーを追加します。

source: For example, the name of the following message bundle will be defaulted to `Controller_index`:
ja_jp: 例えば、以下のメッセージバンドルの名前は、デフォルトで `Controller_index` になります:

source: For example, this can happen when an invalid scope or other invalid parameters are included in the redirect to the provider.
ja_jp: これは、たとえば、プロバイダーへのリダイレクトに無効なスコープまたはその他の無効なパラメーターが含まれている場合に発生する可能性があります。

source: For example, this defines the `@WithKubernetesTestServer` annotation, which you can use on your tests to activate the `KubernetesServerTestResource`, but only for the annotated test class. You can also place them on your `QuarkusTestProfile` test profiles.
ja_jp: たとえば、これは `@WithKubernetesTestServer` アノテーションを定義します。これは、テストで `KubernetesServerTestResource` をアクティブ化するために使用できますが、アノテーションが付けられたテストクラスに限定されます。これは `QuarkusTestProfile` テストプロファイルに配置することもできます。

source: For example, this might later be helpful to wire device status reporting through MQTT via Kafka, using the appropriate Quarkus extensions.
ja_jp: たとえば、これは後で適切な Quarkus エクステンションを使用して、Kafka 経由で MQTT を通じてデバイスステータスレポートを送信する場合に役立つ可能性があります。

source: For example, this will fail:
ja_jp: 例えば、このような場合、失敗します:

source: For example, to add the PostgreSQL driver dependency:
ja_jp: 例えば、PostgreSQLドライバー依存関係を追加します：

source: For example, to configure the Kafka connector to consume messages from the `my-topic` topic with a custom deserializer:
ja_jp: たとえば、カスタムデシリアライザーを使用して `my-topic` トピックからのメッセージを消費するように Kafka コネクターを設定するには、以下のようにします。

source: For example, to configure the `max.block.ms` property, use:
ja_jp: たとえば、 `max.block.ms` プロパティーを設定するには、次を使用します。

source: For example, to configure the `max.poll.records` property, use:
ja_jp: たとえば、 `max.poll.records` プロパティーを設定するには、次を使用します。

source: For example, to deploy the native Java 17 version to OpenShift, simply run `+kubectl apply -f deploy/k8s/native-java17-openshift.yml+` (or `+oc apply -f deploy/k8s/native-java17-openshift.yml+`).
ja_jp: 例えば、ネイティブのJava 17バージョンをOpenShiftにデプロイするには、単に `kubectl apply -f deploy/k8s/native-java17-openshift.yml` （または `oc apply -f deploy/k8s/native-java17-openshift.yml` ）を実行します。

source: For example, to enable both `TLSv1.3` and `TLSv1.2`:
ja_jp: たとえば、`TLSv1.3` と `TLSv1.2` の両方を有効にするには、次のように指定します。

source: For example, to only enable `TLSv1.3`:
ja_jp: たとえば `TLSv1.3` のみを有効にするには、次のように指定します。

source: For example, to specify a custom Dockerfile named `Dockerfile.custom-jvm`:
ja_jp: 例えば、 `Dockerfile.custom-jvm` というカスタムDockerfileを指定するには、以下のようにします：

source: For example, to specify a custom Dockerfile named `Dockerfile.custom-native`:
ja_jp: 例えば、`Dockerfile.custom-native` という名前のカスタム Dockerfile を指定するには:

source: For example, to use Stork to determine the actual address for REST Client Reactive, set the scheme of your client's URI to `stork`, and the hostname of the URI to the name of the Stork service. If your client's `configKey` is `my-client`, to use it with Hashicorp Consul and the `round-robin` load balancer, put the following in your `application.properties:
ja_jp: 例えば、Storkを使ってREST Client Reactiveの実際のアドレスを決定するには、クライアントのURIのスキームを `stork` 、URIのホスト名をStorkのサービス名に設定します。クライアントの `configKey` が `my-client` である場合、Hashicorp Consul と `round-robin` ロードバランサーで使用するためには、以下を `application.properties に追加して下さい:

source: For example, to use a https://buildpacks.io/[Cloud Native Buildpack] with a custom builder image, use the following:
ja_jp: たとえば、 link:https://buildpacks.io/[Cloud Native Buildpack] をカスタムビルダーイメージで使用するには、次のようにします：

source: For example, to you use the Mutiny variant of the Vert.x Web client, add the following dependency:
ja_jp: 例えば、Vert.x Web クライアントの Mutiny 版を使用するには、以下の依存関係を追加します:

source: For example, using the `rhoas` CLI, you can grant the `MANAGER` role to the service account:
ja_jp: たとえば、 `rhoas` CLI を使用して、サービスアカウントに `MANAGER` ロールを付与することができます。

source: For example, usually you need to disable the discovery and specify individual endpoint URLs when working with OAuth2 providers, see the xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 providers] section for more details.
ja_jp: たとえば、 OAuth2 プロバイダーを扱う場合は通常、ディスカバリーを無効にして個別のエンドポイント URL を指定する必要があります。詳細は xref:security-oidc-code-flow-authentication.adoc#oauth2[OAuth2 プロバイダー] セクションを参照してください。

source: For example, we can call the user tag defined below with `{#test 'Martin' readonly=true /}`.
ja_jp: たとえば、以下のように定義されたユーザータグを `{#test 'Martin' readonly=true /}` で呼び出すことができます。

source: For example, we can write a ConfigMap resource only once in the file `src/main/kubernetes/common.yml`:
ja_jp: 例えば、ConfigMapリソースをファイル `src/main/kubernetes/common.yml` に一度だけ書き込むことができます:

source: For example, when a local logout with <<oidc-session,OidcSession>> is performed, you can use an injected `OidcProviderClient` to revoke access and refresh tokens associated with the current session:
ja_jp: たとえば、<<oidc-session,OidcSession>> でローカルログアウトが実行されると、注入された `OidcProviderClient` を使用して、現在のセッションに関連付けられているアクセストークンとリフレッシュトークンを取り消すことができます。

source: For example, when accessing an Elasticsearch cluster that is set up for TLS on the HTTP layer, the client needs to trust the certificate that Elasticsearch is using. The following is an example of setting up the client to trust the CA that has signed the certificate that Elasticsearch is using, when that CA certificate is available in a PKCS#12 keystore.
ja_jp: 例えば、HTTPレイヤでTLS用に設定されているElasticsearchクラスタにアクセスする場合、クライアントはElasticsearchが使用している証明書を信頼する必要があります。以下は、Elasticsearchが使用している証明書に署名したCAの証明書がPKCS#12のキーストアで利用可能な場合に、クライアントがそのCAの証明書を信頼するように設定する例です。

source: For example, when launching a Quarkus application, the code lens URL endpoints (enabled via. the `microprofile.tools.codeLens.urlCodeLensEnabled` setting) now supports `@ApplicationPath` and will take its value into account.
ja_jp: たとえば、Quarkusアプリケーションの起動時に、コードレンズURLエンドポイント（ `microprofile.tools.codeLens.urlCodeLensEnabled` 設定により有効）は `@ApplicationPath` をサポートし、その値が考慮されるようになりました。

source: For example, when working with GitHub, the Quarkus endpoint can acquire an `access` token which will allow it to request a GitHub profile of the current user. In fact this is exactly how a standard OpenID Connect `UserInfo` acquisition also works - by authenticating into your OpenID Connect provider you also give a permission to Quarkus application to acquire your <<user-info,UserInfo>> on your behalf - and it also shows what is meant by OpenID Connect being built on top of OAuth2.
ja_jp: 例えば、GitHub で作業する場合、Quarkus のエンドポイントは `access` トークンを取得し、現在のユーザーの GitHub プロファイルを要求することができます。実際、標準的な OpenID Connect の `UserInfo` の取得も、このように動作します。OpenID Connect プロバイダーを認証することで、Quarkus アプリケーションに、ユーザーの代わりに <<user-info,ユーザー情報>> を取得する許可を与えることになります。また、これは、OpenID Connect が OAuth2 の上に構築されていることの意味も示しています。

source: For example, when working with GitHub, the Quarkus endpoint can acquire an `access` token, which allows the Quarkus endpoint to request a GitHub profile for the current user.
ja_jp: たとえば、GitHub と連携する場合、Quarkus エンドポイントは `access` トークンを取得できます。これにより、Quarkus エンドポイントは現在のユーザーの GitHub プロファイルをリクエストできます。

source: For example, when working with `GitHub`, the Quarkus endpoint can acquire an `access` token which will allow it to request a `GitHub` profile of the current user. In fact this is exactly how a standard `OpenID Connect` `UserInfo` acqusition also works - by authenticating into your `OpenID Connect` provider you also give a permission to Quarkus application to acquire your <<user-info,UserInfo>> on your behalf - and it also shows what is meant by `OpenID Connect` being built on top of `OAuth2`.
ja_jp: 例えば、 `GitHub` を使用する場合、Quarkusエンドポイントは `access` トークンを取得することができ、これにより現在のユーザーの `GitHub` プロファイルを要求することができます。 `OpenID Connect` `UserInfo` `OpenID Connect` プロバイダで認証することで、Quarkusアプリケーションに、ユーザーに代わって xref:user-info[UserInfo] を取得する許可を与えることになります。また、 `OpenID Connect` が `OAuth2` の上に構築されていることの意味も示しています。

source: For example, when you use Quarkus REST (formerly RESTEasy Reactive) or gRPC, Quarkus can invoke your business logic on I/O threads. These threads are named https://en.wikipedia.org/wiki/Event_loop[event loops] and implement a https://en.wikipedia.org/wiki/Reactor_pattern[multi-reactor pattern].
ja_jp: たとえば、Quarkus REST（旧RESTEasy Reactive）やgRPCを使用すると、QuarkusはI/Oスレッドでビジネスロジックを呼び出すことができます。 これらのスレッドは link:https://en.wikipedia.org/wiki/Event_loop[イベントループ] と名付けられ、 link:https://en.wikipedia.org/wiki/Reactor_pattern[マルチリアクターパターン] を実装します。

source: For example, when your application supports a standard <<user-initiated-logout>>, you can catch a logout event and revoke tokens:
ja_jp: たとえば、アプリケーションが標準の <<user-initiated-logout>> をサポートしている場合、ログアウトイベントをキャッチしてトークンを取り消すことができます。

source: For example, with Apicurio Dev Service if you set the image name to use version `2.1.5.Final`:
ja_jp: 例えば、Apicurio Dev Serviceで、バージョン `2.1.5.Final` を使用するようにイメージ名を設定した場合：

source: For example, with Apicurio dev service if you set the image name to use version `2.1.5.Final`:
ja_jp: 例えば、Apicurio dev serviceで、イメージ名をバージョン `2.1.5.Final` を使用するように設定した場合：

source: For example, with a client like so:
ja_jp: このようなクライアントは、たとえば以下のようになります。

source: For example, with the following configuration:
ja_jp: 例えば、次のような設定です:

source: For example, you already have an application that uses the Hibernate ORM extension together with a PostgreSQL JDBC Driver and your datasource is configured like this:
ja_jp: たとえば、Hibernate ORM エクステンションと PostgreSQL JDBC ドライバーを併用するアプリケーションがすでにあり、データソースが次のように設定されているとします。

source: For example, you already have an application that uses the Hibernate ORM extension together with a PostgreSQL JDBC Driver, and your datasource is configured like this:
ja_jp: たとえば、Hibernate ORM エクステンションと PostgreSQL JDBC ドライバーを併用するアプリケーションがすでにあり、データソースが次のように設定されているとします。

source: For example, you can do `quarkus.oidc.token-state-manager.strategy=id-refresh-tokens` which means that your application is not intending to use an access token directly or propagate it to downstream services, all it wants is to use ID token to interact with the user and keep refreshing the session.
ja_jp: たとえば、`quarkus.oidc.token-state-manager.strategy=id-refresh-tokens` と設定できます。これは、アプリケーションがアクセストークンを直接使用したりダウンストリームサービスに伝播したりする予定がなく、ユーザーとの対話に ID トークンを使用し、セッションのリフレッシュを継続することのみを目的としていることを意味します。

source: For example, you can recover with a fallback item using `onFailure().recoverWithItem(fallback)`:
ja_jp: 例えば、 `onFailure().recoverWithItem(fallback)` を使ったフォールバックアイテムでリカバリーできます。

source: For example, you can send to a dynamic address based on the incoming message:
ja_jp: たとえば、incoming メッセージに基づいて動的アドレスに送信できます。

source: For example, you can set `quarkus.oidc.token.authorization-scheme=DPoP` to accept the DPoP access tokens sent as `Authorization: DPoP <token>`. See the xref:security-oidc-bearer-token-authentication#demonstrating-proof-of-possession-dpop[Demonstrating Proof of Possession] section for more information.
ja_jp: たとえば、 `quarkus.oidc.token.authorization-scheme=DPoP` を設定することで、 `Authorization: DPoP <token>` として送信される DPoP アクセストークンを受け入れることができます。詳細は xref:security-oidc-bearer-token-authentication#demonstrating-proof-of-possession-dpop[Demonstrating Proof of Possession] セクションを参照してください。

source: For example, you can specify the `quarkus.debug.generated-classes-dir` system property to have these classes written out to disk for inspection in the development mode:
ja_jp: 例えば、 `quarkus.debug.generated-classes-dir` システムプロパティを指定すると、これらのクラスがディスクに書き出され、開発モードで検査できるようになります。

source: For example, you can update the properties shown in the section which introduces <<mutual-tls>> as follows:
ja_jp: たとえば、以下のように <<mutual-tls>> を紹介するセクションで表示されるプロパティーを更新できます。

source: For example, you can use Dev UI to test Google authentication with this configuration:
ja_jp: たとえば、Dev UI を使用して、次の設定で Google 認証をテストできます。

source: For example, you can use Docker to run your database:
ja_jp: 例えば、Dockerを使ってデータベースを動かすことができます。

source: For example, you can use `@RunOnVirtualThread` directly on the method:
ja_jp: たとえば、次のようにメソッドで直接 `@RunOnVirtualThread` を使用できます。

source: For example, you can use the `Mailer` in an HTTP endpoint as follows:
ja_jp: 例えば、 `Mailer` を HTTP のエンドポイントで使用する場合は次のようになります:

source: For example, you could ensure connections are recycled after 60 minutes:
ja_jp: たとえば、60 分後に接続が再利用されるように指定できます。

source: For example, you could expire idle connections after 60 minutes:
ja_jp: たとえば、アイドル状態の接続を 60 分後に期限切れにすることができます。

source: For example, you have the following configuration:
ja_jp: たとえば、次のような設定があるとします。

source: For example, you may want to enforce that the token is bound to the inlined certificate chain with one of its claims.
ja_jp: たとえば、トークンがそのクレームの 1 つを使用してインライン証明書チェーンにバインドされていることを強制したい場合があります。

source: For example, you might have to read a specific file only present in production, or retrieve configuration data from a proprietary configuration server.
ja_jp: たとえば、実稼働環境にのみ存在する特定のファイルを読み取ったり、独自の設定サーバーから設定データを取得したりする必要がある場合があります。

source: For example, you might want to add an interceptor binding to a specific bean class. Here is how to do it:
ja_jp: たとえば、特定の Bean クラスにインターセプターバインディングを追加するとします。以下はその方法です。

source: For example, you might want to add an interceptor binding to a specific bean class. You can use a convenient builder API to create a transformation instance:
ja_jp: たとえば、特定の Bean クラスにインターセプターバインディングを追加する必要があることもあります。 その場合は、便利なビルダー API を使用して変換インスタンスを作成できます。

source: For example, you might want to keep the tokens in a cache cluster and have only a key stored in a session cookie. Note that this approach might introduce some challenges if you need to make the tokens available across multiple microservice nodes.
ja_jp: たとえば、トークンをキャッシュクラスターに保持し、キーのみをセッション Cookie に保存することもできます。 トークンを複数のマイクロサービスノードで利用できるようにする必要がある場合、このアプローチではいくつかの課題が生じる可能性があることに注意してください。

source: For example, you might want to keep the tokens in a cache cluster and have only a key stored in a session cookie. Note that this approach might introduce some challenges if you need to make the tokens available across multiple microservices nodes.
ja_jp: たとえば、トークンをキャッシュクラスターに保持し、キーのみをセッションクッキーに保存することを推奨します。 トークンを複数のマイクロサービスノードで利用できるようにする必要がある場合、このアプローチではいくつかの課題が生じる可能性があることに注意してください。

source: For example:
ja_jp: 例えば、以下のようになります:

source: For example: `curl \http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com`.
ja_jp: 例： `curl http://openshift-helloworld-username-dev.apps.sandbox-m2.ll9k.p1.openshiftapps.com` .

source: For examples of propagating access tokens, see the following sections in this tutorial. For more information about token propagation, see xref:security-openid-connect-client-reference.adoc#reactive-token-propagation[OIDC token propagation].
ja_jp: アクセストークンを伝播する場合の例については、このチュートリアルの次のセクションを参照してください。 トークンの伝播についての詳細は、xref:security-openid-connect-client-reference.adoc#reactive-token-propagation[OIDC トークンの伝播] を参照してください。

source: For examples of propagating access tokens, see the following sections in this tutorial. For more information about token propagation, see xref:security-openid-connect-client-reference.adoc#token-propagation-rest[OIDC token propagation].
ja_jp: アクセストークンの伝播の例については、このチュートリアルの以下のセクションを参照してください。 トークンの伝播の詳細については、 xref:security-openid-connect-client-reference.adoc#token-propagation-rest[OIDC トークンの伝播] を参照してください。

source: For existing applications where all extensions are available, we have an OpenRewrite recipe that you can try.
ja_jp: すべてのエクステンションが利用可能な既存のアプリケーションについては、OpenRewriteのレシピを用意していますので、お試しください。

source: For exotic image names, Quarkus might be unable to infer the distribution (`elastic` or `opensearch`). In these cases starting the Dev Services will fail, and you will need to configure the distribution explicitly:
ja_jp: エキゾチックなイメージ名の場合、Quarkusはディストリビューションを推測できないことがあります（ `elastic` または `opensearch` ）。 このような場合、Dev Servicesの起動に失敗し、ディストリビューションを明示的に設定する必要があります：

source: For extension development, use `org.jboss.logging.Logger.getLogger(String)` instead of `io.quarkus.logging.Log`.
ja_jp: エクステンションの開発では、 `io.quarkus.logging.Log` の代わりに `org.jboss.logging.Logger.getLogger (String)` を使用します。

source: For extensions hosted outside of the Quarkus core[https://github.com/quarkusio/quarkus] repository, codestarts will typically be located in the runtime module (with special instruction in the `pom.xml` to generate a separate codestart artifact). https://github.com/ia3andy/aloha-code/[Here, window="_blank"] is an example extension with a codestart and its tests.
ja_jp: Quarkus core[https://github.com/quarkusio/quarkus] リポジトリ以外でホストされているエクステンションの場合、codestartは通常、ランタイムモジュールに配置されます（別のコードスタートアーティファクトを生成するために、 `pom.xml` に特別な指示があります）。 link:https://github.com/ia3andy/aloha-code/[以下, window=_blank]は、codestartとそのテストを持つエクステンションの例です。

source: For failure, use: `onFailure().invoke(failure -> ...)`
ja_jp: 失敗の場合は、次を使用してください: `onFailure().invoke(failure → …​)`

source: For finer control, you can combine Qute Web with Quarkus REST (formerly RESTEasy Reactive) or the legacy RESTEasy Classic-based extension to control how your template will be served
ja_jp: よりきめ細かく制御するには、Qute Web を Quarkus REST (旧 RESTEasy Reactive) または従来の RESTEasy Classic ベースの エクステンション と組み合わせて、テンプレートがどのように提供されるかを制御できます。

source: For finer control, you can combine Qute Web with Quarkus REST or Quarkus RESTEasy to control how your template will be served
ja_jp: より細かい制御のために、Qute Web を Quarkus REST または Quarkus RESTEasy と組み合わせて、テンプレートの提供方法を制御できます。

source: For finer control, you can combine it with Quarkus REST to control how your template will be served. All files located in the `src/main/resources/templates` directory and its subdirectories are registered as templates and can be injected in a REST resource.
ja_jp: より細かく制御するには、Quarkus REST と組み合わせて、テンプレートの提供方法を制御できます。`src/main/resources/templates` ディレクトリーとそのサブディレクトリーにあるすべてのファイルは、テンプレートとして登録され、REST リソースに注入できます。

source: For float and double values the fractional digits must be separated by a dot `.`
ja_jp: float 型および double 型の値の場合、小数桁はドット `.` で区切る必要がある

source: For full Gradle details <<gradle, see below>>.
ja_jp: Gradleの詳細は link:#gradle[こちらを参照してください] 。
